InformationRegisters/бит_ДоступныеИнтерфейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ДоступныеИнтерфейсы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоступенРусский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ДоступныеИнтерфейсы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытийЭлементовФормы
	
// Процедура проверяет правильность настроек доступности интерфеса в регистре бит_ДоступныеИнтерфейсы. 
// И устанавливает новые настройки, согласно настройкам пользователя. 
//
// Параметры:
//  ТекПользователь – СправочникСсылка.Пользователи.
//
Процедура ПроверитьУстановитьДоступностьРусскогоИнтерфейса(ТекПользователь) Экспорт

  Если НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
  
  	Возврат;
  
  КонецЕсли; 	
  
  УстановитьПривилегированныйРежим(Истина);
  
  флДоступенРусский = ОпределитьДоступностьРусскогоИнтерфейса(ТекПользователь);
  
  Запрос = Новый Запрос;
  Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
  Запрос.Текст = "ВЫБРАТЬ
                 |	бит_ДоступныеИнтерфейсы.ДоступенРусский
                 |ИЗ
                 |	РегистрСведений.бит_ДоступныеИнтерфейсы КАК бит_ДоступныеИнтерфейсы
                 |ГДЕ
                 |	бит_ДоступныеИнтерфейсы.Пользователь = &Пользователь";
				 
  Результат = Запрос.Выполнить();
  
  флУстановить = Истина;
  
  Выборка = Результат.Выбрать();
  
  Если Выборка.Следующий() Тогда
  
  	 флУстановить = ?(Выборка.ДоступенРусский <> флДоступенРусский, Истина, Ложь);
  
  КонецЕсли; 
  
  Если флУстановить Тогда
	  
	 УстановитьДоступностьИнтерфейса(ТекПользователь, флДоступенРусский);
	 
  КонецЕсли; 
  
  УстановитьПривилегированныйРежим(Ложь);
  
КонецПроцедуры // ПроверитьУстановитьДоступностьИнтерфейса()

// Процедура устанавливает доступность интерфейса.
//
// Параметры:
//  ТекПользователь – СправочникСсылка.Пользователи.
//  ДоступенРусский - Булево.
//
Процедура УстановитьДоступностьИнтерфейса(ТекПользователь, ДоступенРусский) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.бит_ДоступныеИнтерфейсы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = ТекПользователь;
	МенеджерЗаписи.ДоступенРусский = ДоступенРусский;
	
	Попытка
		
		МенеджерЗаписи.Записать();
		
	Исключение
		
		ТекстСообщения =  НСтр("ru = 'Не удалось установить доступность интерфейса пользователю ""%1%""! Описание ошибки : ""%2%"".'");
		ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыСтроки(ТекстСообщения, ТекПользователь, ОписаниеОшибки());
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры // УстановитьДоступностьИнтерфейса()

// Функция определяет доступность русского интерфейса пользователю.
//
// Параметры:
//  ТекПользователь - СправочникСсылка.Пользователи.
//
// Возвращаемое значение:
//  флДоступенРусский – Булево.
//
Функция ОпределитьДоступностьРусскогоИнтерфейса(ТекПользователь) Экспорт
	
	флДоступенРусский = Истина;
	
	Если ЗначениеЗаполнено(ТекПользователь) Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекПользователь.ИдентификаторПользователяИБ);
		
		Если НЕ ПользовательИБ = Неопределено Тогда
			
			Если ПользовательИБ.Язык <> Неопределено И ПользовательИБ.Язык <> Метаданные.Языки.Русский Тогда
				
				флДоступенРусский = Ложь;
				
			Иначе	
				
				флДоступенРусский = Истина;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат флДоступенРусский;
	
КонецФункции // ОпределитьДоступностьРусскогоИнтерфейса()

#КонецОбласти

#КонецЕсли
